Project/Toir.Adaptation/src/Catalogs/торо_ИдентификаторыТехКарт/торо_ИдентификаторыТехКарт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ИдентификаторыТехКарт</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <hierarchyType>Checked</hierarchyType>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>гкс_Владелец</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4380d8c9-cbf4-44cf-b7c9-1da41ff5be61">
    <name>гкс_Обслуживание</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="67f4d7dd-7bf2-4031-a04a-7940d981637a">
    <name>гкс_Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

Project/Toir.Adaptation/src/InformationRegisters/торо_ВерсииТехКарт/торо_ВерсииТехКарт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ВерсииТехКарт</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ТехКарта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>ИдентификаторТехКарты</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/Catalogs/торо_ТехКарты/торо_ТехКарты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ТехКарты</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>НормаВремениТекст</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СодержитОпасныеОперации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СодержитРаботыПовышеннойОпасности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВремяПростояТекст</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДатаПринятия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ВыполнениеРемонтаТребуетОстановаОборудования</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидПростоя</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="318cfb02-93d9-4e72-b18b-d94c75743551">
    <name>гкс_ШаблонОригинал</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3596ff4d-323b-42dc-9670-b09c4c53eb1a">
    <name>гкс_ПериодДействия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c8b1bb05-348c-4004-a9c7-f4334bfd4798">
    <name>гкс_ДатаОкончанияАктуальности</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="cda9ddcc-962a-45a2-b3c3-e94d16217457">
    <name>гкс_КоличествоПериодовДействия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections>
    <name>СписокОпераций</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Операция</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Продолжительность</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>11</precision>
            <scale>4</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НормаВремениВСекундах</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>11</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СпособВыполнения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="00e732b3-dcfc-4752-8d6d-92d8a2df1df3">
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="fbc4c1a4-e43e-422b-b50e-564f58400e1c">
      <name>гкс_Примечание</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТрудовыеЗатраты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ВремяРаботы</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>4</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Операция</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Квалификация</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МатериальныеЗатраты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Операция</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИнструментыИТехника</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Операция</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Инструмент</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="b4f819bb-d0da-4bc8-9121-c57956d6248f">
    <name>ИзмеряемыеПоказатели</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="4723efe0-b00c-4604-ae16-cebdc894e7a4">
      <name>гкс_ТребуемыйРезультатИзмерения</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>4</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="8c232819-8c55-4920-9838-1aa96476a92f">
    <name>гкс_ИспытанияОборудования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="af1662b9-55f3-4d05-b29c-04399c6b9e0f">
      <name>ИспытаниеОборудования</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir.Adaptation/src/Catalogs/торо_ИдентификаторыТехКарт/ManagerModule.bsl
#Область ОбработчикиСобытий

 // Гкс+[TOIR20-622] Оселедько В.С. от 25.07.2025. Добавлено:{
&Перед("ОбработкаПолученияФормы")
Процедура гкс_ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		
		ВремяНачала = ОценкаПроизводительности.НачатьЗамерВремени();
		Параметры.Вставить("ВремяНачалаОткрытияФормы", ВремяНачала);
		СтандартнаяОбработка = Ложь;
		ВыбраннаяФорма = Метаданные.Справочники.торо_ИдентификаторыТехКарт.Формы.ФормаЭлемента.Имя;		
		
	ИначеЕсли ВидФормы = "ФормаСписка" Тогда
		
		ВремяНачала = ОценкаПроизводительности.НачатьЗамерВремени();
		Параметры.Вставить("ВремяНачалаОткрытияФормы", ВремяНачала);
		СтандартнаяОбработка = Ложь;
		ВыбраннаяФорма = Метаданные.Справочники.торо_ИдентификаторыТехКарт.Формы.ФормаСписка.Имя;
		
	КонецЕсли;
	
КонецПроцедуры // } Гкс-[TOIR20-622]

#КонецОбласти
 
&Вместо("ПечатьТехКарты")
Функция гкс_ПечатьТехКарты(МассивОбъектов, ПараметрыПечати)
	ТабДок = Новый ТабличныйДокумент;
	Макет = УправлениеПечатью.МакетПечатнойФормы("Справочник.торо_ИдентификаторыТехКарт.ПФ_MXL_ТехКарта"); 
	ОбластьОтступ = Макет.ПолучитьОбласть("Отступ");
	ЭтоПервый = Истина;
		
	Для каждого Объект из МассивОбъектов Цикл
		
		Если ПараметрыПечати.Свойство("ДатаПринятия") Тогда
			ДатаПринятия =  ПараметрыПечати.ДатаПринятия;
		Иначе 
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			               |	торо_ВерсииТехКартСрезПоследних.ТехКарта.ДатаПринятия КАК ДатаПринятия
			               |ИЗ
			               |	РегистрСведений.торо_ВерсииТехКарт.СрезПоследних(, ИдентификаторТехКарты = &Ссылка) КАК торо_ВерсииТехКартСрезПоследних";
			
			Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
			Результат = Запрос.Выполнить();
			
			Если Результат.Пустой() Тогда
				Продолжить;
			КонецЕсли;
			
			ДатаПринятия = Результат.Выгрузить()[0].ДатаПринятия;
		КонецЕсли;
	
		ТехКарта = РегистрыСведений.торо_ВерсииТехКарт.ПолучитьВерсиюТехКарты(Объект, ДатаПринятия);
		
		Если НЕ ЗначениеЗаполнено(ТехКарта)Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЭтоПервый Тогда
			ТабДок.Вывести(ОбластьОтступ);
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ЭтоПервый = Ложь;
		
		ОбластьНаименования = Макет.ПолучитьОбласть("Название");
		ОбластьНаименования.Параметры.Наименование = Строка(Объект);
		ТабДок.Вывести(ОбластьНаименования);
		
		ОбластьШапки = Макет.ПолучитьОбласть("Шапка");
		ОбластьШапки.Параметры.Наименование = Строка(Объект);
		ОбластьШапки.Параметры.ПродолжительностьТехКарты = ПреобразоватьВремя(ТехКарта.НормаВремени);
		ОбластьШапки.Параметры.ДатаНачала = Формат(ТехКарта.ДатаПринятия, "ДФ=dd.MM.yyyy");
		ТабДок.Вывести(ОбластьШапки);
		
		ОблКомментарийТК = Макет.ПолучитьОбласть("КомментарийТК");
		ОблКомментарийТК.Параметры.КомментарийТК = ТехКарта.Комментарий; 
		ТабДок.Вывести(ОблКомментарийТК);	
				
		ШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ТабДок.Вывести(ШапкаТаблицы);
		
		ТЗ = Новый ТаблицаЗначений;
		Дерево = Новый ДеревоЗначений;
		Индекс = 0;
		ЗаполнитьТЗ(Объект,ТЗ, Индекс, ,ТехКарта.ДатаПринятия);
		ИндексДерева = 0;
		ЗаполнитьДерево(Объект, Дерево, ИндексДерева, ,ТехКарта.ДатаПринятия);
				
		НовыйТЗ = Новый ТаблицаЗначений;
		НовыйТЗ = ТЗ.Скопировать();
		
		Если ТЗ.Количество() <> 0 Тогда
			// гкс+ [10.23] Деснол 13.06.2024
			НовыйТЗ.Свернуть( "Родитель1, Операция, СпособВыполнения, Кратность, гкс_Примечание" );
			// гкс- [10.23] Деснол 13.06.2024
		КонецЕсли;
		
		ИтоговаяТз = НОвый ТаблицаЗначений;
		ИтоговаяТз.Колонки.Добавить( "Родитель1" );
		ИтоговаяТз.Колонки.Добавить( "ТехнологическаяОперация" );
		ИтоговаяТз.Колонки.Добавить( "Продолжительность" );
		ИтоговаяТз.Колонки.Добавить( "СпособВыполнения" );
		ИтоговаяТз.Колонки.Добавить( "МатериальныеЗатратыИКоличество" );
		ИтоговаяТз.Колонки.Добавить( "ТрудозатратыКоличествоВремяРаботы" );
		ИтоговаяТз.Колонки.Добавить( "ИнстурментыИТехника" );
		ИтоговаяТз.Колонки.Добавить( "Показатель" );
		ИтоговаяТз.Колонки.Добавить( "ПолноеНаименование" );
		ИтоговаяТз.Колонки.Добавить( "Кратность" );
		ИтоговаяТз.Колонки.Добавить( "Комментарий" );
		// гкс+ [10.23] Деснол 14.06.2024
		ИтоговаяТз.Колонки.Добавить( "гкс_Примечание" );
		// гкс- [10.23] Деснол 14.06.2024
		
		Для Каждого СтрокаНовыйТЗ Из НовыйТЗ Цикл
			// гкс+ [10.23] Деснол 13.06.2024
			МассивСтрок = ТЗ.НайтиСтроки(Новый Структура( "Родитель1, Операция, гкс_Примечание",СтрокаНовыйТЗ.Родитель1, СтрокаНовыйТЗ.Операция , СтрокаНовыйТЗ.гкс_Примечание));
			// гкс- [10.23] Деснол 13.06.2024
			НоваяСтрокаИтоговойТаблицы = ИтоговаяТз.Добавить();
			
			// гкс+ [10.23] Деснол 14.06.2024
			НоваяСтрокаИтоговойТаблицы.гкс_Примечание               = СтрокаНовыйТЗ.гкс_Примечание; 
			// гкс- [10.23] Деснол 14.06.2024
			НоваяСтрокаИтоговойТаблицы.Родитель1               = СтрокаНовыйТЗ.Родитель1; 
			НоваяСтрокаИтоговойТаблицы.ТехнологическаяОперация = СтрокаНовыйТЗ.Операция;
			НоваяСтрокаИтоговойТаблицы.СпособВыполнения 	   = СтрокаНовыйТЗ.СпособВыполнения;
			НоваяСтрокаИтоговойТаблицы.Кратность		       = СтрокаНовыйТЗ.Кратность;
						
			Если ТипЗнч(СтрокаНовыйТЗ.Операция) = Тип("СправочникСсылка.торо_ТехнологическиеОперации") Тогда
				НоваяСтрокаИтоговойТаблицы.ПолноеНаименование		   = СтрокаНовыйТЗ.Операция.СодержаниеРабот;
			КонецЕсли;
			
			ВремяЧасов = Цел(МассивСтрок[0].Продолжительность/60/60);
			ВремяМинут = Цел(Число(МассивСтрок[0].Продолжительность - 3600 * ВремяЧасов) / 60);
			
			НоваяСтрокаИтоговойТаблицы.Продолжительность       = Строка(ВремяЧасов) + " ч. " + Строка(ВремяМинут) + " мин. ";
			
			Материалы         = "";
			Трудозатраты      = "";
			Инструмент        = "";
			Показатель        = "";
			МерыБезопасности  = "";
			Комментарий       = "";
			
			ИспользоватьХарактеристики = Константы.торо_ИспользоватьХарактеристикиНоменклатуры.Получить();
						
			Для Каждого СтрокаМассива Из МассивСтрок Цикл
				
				Если ЗначениеЗаполнено(СтрокаМассива.Номенклатура) Тогда
					МатериалыХарактеристика =  "";
					ПереносСПервойСтроки = ?(Материалы = "","", Символы.ПС);
					Если ИспользоватьХарактеристики Тогда
						МатериалыХарактеристика = ?(ЗначениеЗаполнено(СтрокаМассива.Характеристика), ", " + СтрокаМассива.Характеристика, 
				                          ?(ЗначениеЗаполнено(СтрокаМассива.НаименованиеХарактеристики), ", " + СтрокаМассива.НаименованиеХарактеристики,""));				  
					КонецЕсли;
					Материалы = Материалы + ПереносСПервойСтроки + Строка(СтрокаМассива.Номенклатура) + МатериалыХарактеристика + ", " + Строка(СтрокаМассива.Количество) + " " + Строка(СтрокаМассива.ЕдиницаИзмерения) + ".";
				КонецЕсли;
				
				Если ЗначениеЗаполнено(СтрокаМассива.Квалификация) Тогда
					ПереносСПервойСтроки = ?(Трудозатраты = "","", Символы.ПС);
					Трудозатраты = Трудозатраты + ПереносСПервойСтроки + Строка(СтрокаМассива.Квалификация) + ", " + Строка(СтрокаМассива.КолКвалификаций) + ", " + ПреобразоватьВремя(СтрокаМассива.ВремяРаботы);
				КонецЕсли;
				
				Если ЗначениеЗаполнено(СтрокаМассива.Инструмент) Тогда
					ПереносСПервойСтроки = ?(Инструмент = "","", Символы.ПС);
					Инструмент = Инструмент + ПереносСПервойСтроки + Строка(СтрокаМассива.Инструмент) + ", " + Строка(СтрокаМассива.КолИнстр) + " " + Строка(СтрокаМассива.ЕдИзмИнстр);
				КонецЕсли;
				
				Если ЗначениеЗаполнено(СтрокаМассива.Показатель) Тогда
					ПереносСПервойСтроки = ?(Показатель = "","", Символы.ПС);
					Показатель = Показатель + ПереносСПервойСтроки + Строка(СтрокаМассива.Показатель);
				КонецЕсли;
				
				Если ЗначениеЗаполнено(СтрокаМассива.Комментарий) Тогда 
				    Комментарий = СтрокаМассива.Комментарий;
				КонецЕсли;
				
			КонецЦикла;
			
			НоваяСтрокаИтоговойТаблицы.МатериальныеЗатратыИКоличество = Материалы;
			НоваяСтрокаИтоговойТаблицы.ТрудозатратыКоличествоВремяРаботы = Трудозатраты;
			НоваяСтрокаИтоговойТаблицы.ИнстурментыИТехника = Инструмент;
			НоваяСтрокаИтоговойТаблицы.Показатель = Показатель;
			НоваяСтрокаИтоговойТаблицы.Комментарий = Комментарий;
		КонецЦикла;
		
		МассивУровней = Новый Массив;
		
		ТабДок.НачатьАвтогруппировкуСтрок();
		Для Каждого Строка Из  ИтоговаяТз Цикл
			
			МассивСтрокДерева = Дерево.Строки.НайтиСтроки(Новый Структура("Родитель1, Операция", Строка.Родитель1, СТрока.ТехнологическаяОперация),Истина);
			Уровень = МассивСтрокДерева[ 0 ].Уровень();
			
			КолЭлем = МассивУровней.ВГраница();
			Если КолЭлем >= Уровень Тогда
				Номер = МассивУровней.Получить(Уровень);
				МассивУровней.Удалить(Уровень);
				МассивУровней.Вставить(Уровень, Номер + 1);
			Иначе
				МассивУровней.Вставить(Уровень,1);
			КонецЕсли;
			СтрокаОперации = Макет.ПолучитьОбласть( "СтрокаТаблицы" );
			СтрокаОперации.Параметры.Заполнить( Строка );
			СтрокаОперации.Параметры.НомерТО = МассивУровней.Получить(Уровень);
			Если ТипЗнч(Строка.ТехнологическаяОперация) = Тип("СправочникСсылка.торо_ТехнологическиеОперации") И Не Строка.ТехнологическаяОперация.НаименованиеДляПечати = "" Тогда
			    СтрокаОперации.Параметры.ТехнологическаяОперация = Строка.ТехнологическаяОперация.НаименованиеДляПечати;
			Иначе
			    СтрокаОперации.Параметры.ТехнологическаяОперация = Строка.ТехнологическаяОперация.Наименование;
			КонецЕсли;
			
			НоваяСтрока = ТабДок.Вывести( СтрокаОперации, Уровень );
			ТабДок.Область(НоваяСтрока.Верх,1).Отступ = Уровень * 2;
			ТабДок.Область(НоваяСтрока.Верх,2).Отступ = Уровень * 2;
			Если ТипЗнч(Строка.ТехнологическаяОперация) = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт") Тогда
				ТабДок.Область("СтрокаТаблицы").ЦветФона = Новый Цвет(156,156,156);
			КонецЕсли;
			
		КонецЦикла;
		ТабДок.ЗакончитьАвтогруппировкуСтрок();
		
	КонецЦикла;
	
	ТабДок.ТолькоПросмотр = Истина;
	
	Возврат ТабДок;
КонецФункции

&Вместо("ЗаполнитьТЗ")
Процедура гкс_ЗаполнитьТЗ(ТехКарта, ТЗ, Индекс, СтрокаРодитель, Дата)
	Запрос = Новый Запрос;
// гкс+ [10.23] Деснол 13.06.2024
// добавил гкс_Примечание
// гкс- [10.23] Деснол 13.06.2024
	Запрос.Текст = "ВЫБРАТЬ
	               |	торо_ТехКарты_СписокОпераций.НормаВремениВСекундах КАК Продолжительность,
	               |	торо_ТехКарты_СписокОпераций.ID КАК ID,
	               |	торо_ТехКарты_СписокОпераций.Операция КАК Операция,
	               |	торо_ТехКарты_СписокОпераций.Ссылка КАК Ссылка,
	               |	торо_ТехКарты_СписокОпераций.СпособВыполнения КАК СпособВыполнения,
	               |	торо_ТехКарты_СписокОпераций.Количество КАК Кратность,
				   |	торо_ТехКарты_СписокОпераций.гкс_Примечание КАК гкс_Примечание,
	               |	ВЫРАЗИТЬ(торо_ТехКарты_СписокОпераций.Операция КАК Справочник.торо_ТехнологическиеОперации).Комментарий КАК Комментарий
	               |ПОМЕСТИТЬ СписокОпераций
	               |ИЗ
	               |	РегистрСведений.торо_ВерсииТехКарт.СрезПоследних(&Дата, ИдентификаторТехКарты = &ТехКарта) КАК торо_ВерсииТехКартСрезПоследних
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ТехКарты.СписокОпераций КАК торо_ТехКарты_СписокОпераций
	               |		ПО торо_ВерсииТехКартСрезПоследних.ТехКарта = торо_ТехКарты_СписокОпераций.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	торо_РемонтыМатериальныеЗатраты.Номенклатура КАК Номенклатура,
	               |	ВЫБОР
	               |		КОГДА торо_РемонтыМатериальныеЗатраты.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
	               |			ТОГДА торо_РемонтыМатериальныеЗатраты.Номенклатура.ЕдиницаИзмерения
	               |		ИНАЧЕ торо_РемонтыМатериальныеЗатраты.ЕдиницаИзмерения
	               |	КОНЕЦ КАК ЕдиницаИзмерения,
	               |	торо_РемонтыМатериальныеЗатраты.Количество КАК Количество,
	               |	торо_РемонтыМатериальныеЗатраты.Характеристика.НаименованиеПолное КАК Характеристика,
	               |	торо_РемонтыМатериальныеЗатраты.Характеристика.Наименование КАК НаименованиеХарактеристики,
	               |	торо_РемонтыМатериальныеЗатраты.ID КАК ID,
	               |	NULL КАК Квалификация,
	               |	NULL КАК ВремяРаботы,
	               |	NULL КАК КолКвалификаций,
	               |	NULL КАК Инструмент,
	               |	NULL КАК КолИнстр,
	               |	NULL КАК ЕдИзмИнстр,
	               |	NULL КАК Показатель
	               |ПОМЕСТИТЬ СписокМатериалов
	               |ИЗ
	               |	Справочник.торо_ТехКарты.МатериальныеЗатраты КАК торо_РемонтыМатериальныеЗатраты
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокОпераций КАК СписокОпераций
	               |		ПО торо_РемонтыМатериальныеЗатраты.Ссылка = СписокОпераций.Ссылка
	               |			И торо_РемонтыМатериальныеЗатраты.ID = СписокОпераций.ID
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	торо_РемонтыТрудовыеЗатраты.ID,
	               |	торо_РемонтыТрудовыеЗатраты.Квалификация,
	               |	торо_РемонтыТрудовыеЗатраты.ВремяРаботы,
	               |	торо_РемонтыТрудовыеЗатраты.Количество,
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	NULL
	               |ИЗ
	               |	Справочник.торо_ТехКарты.ТрудовыеЗатраты КАК торо_РемонтыТрудовыеЗатраты
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокОпераций КАК СписокОпераций
	               |		ПО торо_РемонтыТрудовыеЗатраты.Ссылка = СписокОпераций.Ссылка
	               |			И торо_РемонтыТрудовыеЗатраты.ID = СписокОпераций.ID
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	торо_РемонтыИнструментыИТехника.ID,
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	торо_РемонтыИнструментыИТехника.Инструмент,
	               |	торо_РемонтыИнструментыИТехника.Количество,
	               |	ВЫБОР
	               |		КОГДА торо_РемонтыИнструментыИТехника.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
	               |			ТОГДА торо_РемонтыИнструментыИТехника.Инструмент.ЕдиницаИзмерения
	               |		ИНАЧЕ торо_РемонтыИнструментыИТехника.ЕдиницаИзмерения
	               |	КОНЕЦ,
	               |	NULL
	               |ИЗ
	               |	Справочник.торо_ТехКарты.ИнструментыИТехника КАК торо_РемонтыИнструментыИТехника
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокОпераций КАК СписокОпераций
	               |		ПО торо_РемонтыИнструментыИТехника.Ссылка = СписокОпераций.Ссылка
	               |			И торо_РемонтыИнструментыИТехника.ID = СписокОпераций.ID
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	торо_РемонтыИзмеряемыеПоказатели.ID,
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	торо_РемонтыИзмеряемыеПоказатели.Показатель
	               |ИЗ
	               |	Справочник.торо_ТехКарты.ИзмеряемыеПоказатели КАК торо_РемонтыИзмеряемыеПоказатели
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокОпераций КАК СписокОпераций
	               |		ПО торо_РемонтыИзмеряемыеПоказатели.Ссылка = СписокОпераций.Ссылка
	               |			И торо_РемонтыИзмеряемыеПоказатели.ID = СписокОпераций.ID
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	&ТехКарта КАК Родитель1,
	               |	СписокОпераций.Операция КАК Операция,
	               |	СписокОпераций.Продолжительность КАК Продолжительность,
	               |	СписокМатериалов.Номенклатура КАК Номенклатура,
	               |	СписокМатериалов.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	ЕСТЬNULL(СписокМатериалов.Количество, 0) КАК Количество,
	               |	СписокМатериалов.Характеристика КАК Характеристика,
	               |	СписокМатериалов.НаименованиеХарактеристики КАК НаименованиеХарактеристики,
	               |	СписокМатериалов.Квалификация КАК Квалификация,
	               |	СписокМатериалов.ВремяРаботы КАК ВремяРаботы,
	               |	СписокМатериалов.КолКвалификаций КАК КолКвалификаций,
	               |	СписокМатериалов.Инструмент КАК Инструмент,
	               |	СписокМатериалов.КолИнстр КАК КолИнстр,
	               |	СписокМатериалов.Показатель КАК Показатель,
	               |	СписокМатериалов.ЕдИзмИнстр КАК ЕдИзмИнстр,
	               |	СписокОпераций.СпособВыполнения КАК СпособВыполнения,
	               |	СписокОпераций.Комментарий КАК Комментарий,
				   |	СписокОпераций.гкс_Примечание КАК гкс_Примечание,
	               |	СписокОпераций.Кратность КАК Кратность
	               |ИЗ
	               |	СписокОпераций КАК СписокОпераций
	               |		ЛЕВОЕ СОЕДИНЕНИЕ СписокМатериалов КАК СписокМатериалов
	               |		ПО (СписокМатериалов.ID = СписокОпераций.ID)";
				  
	Запрос.УстановитьПараметр("ТехКарта",ТехКарта);

	Запрос.УстановитьПараметр("Дата", Дата);
	
	
	Результат = Запрос.Выполнить();
	Таблица = Запрос.Выполнить().Выгрузить();

	Для каждого Строка Из Таблица Цикл
		
		Если ТипЗнч(Строка.Операция) = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт") Тогда
			Если Индекс =0 Тогда
				ДобавитьКолонкиВТЗ(ТЗ,Строка, Индекс);
			КонецЕсли;
			НС = ТЗ.Добавить();
			НС.Родитель1 = СтрокаРодитель;
			ЗаполнитьЗначенияСвойств(НС, Строка);	
			ТехнолКарта = РегистрыСведений.торо_ВерсииТехКарт.ПолучитьВерсиюТехКарты(Строка.Операция);
			НС.Комментарий = ТехнолКарта.Комментарий;
			ЗаполнитьТЗ(Строка.Операция, ТЗ, Индекс, СтрокаРодитель, ТехнолКарта.ДатаПринятия);
			
		Иначе	
			Если Индекс =0 Тогда
				ДобавитьКолонкиВТЗ(ТЗ,Строка, Индекс);
            КонецЕсли;
			
			НС = ТЗ.Добавить();
			ЗаполнитьЗначенияСвойств(НС, Строка);
			
		КонецЕсли;
	
	КонецЦикла;
КонецПроцедуры
